[{"summary":"The Time Machine is a science fiction novel by H. G. Wells, published in 1895 and written as a frame narrative. Wells is generally credited with the popularization of the concept of time travel by using a vehicle that allows an operator to travel purposely and selectively forwards or backwards in time. The term \"time machine\", coined by Wells, is now almost universally used to refer to such a vehicle.\nThe Time Machine has been adapted into three feature films of the same name, as well as two television versions, and a large number of comic book adaptations. It has also indirectly inspired many more works of fiction in many media productions.","author":"531EDFA6-A361-4E15-873F-45E4EA0AF120","year":1895,"plot":"The book's protagonist is an English scientist and gentleman inventor living in Richmond, Surrey, in Victorian England, and identified by a narrator simply as the Time Traveller. The narrator recounts the Traveller's lecture to his weekly dinner guests that time is simply a fourth dimension and his demonstration of a tabletop model machine for travelling through it. He reveals that he has built a machine capable of carrying a person through time, and returns at dinner the following week to recount a remarkable tale, becoming the new narrator.\nIn the new narrative, the Time Traveller tests his device with a journey that takes him to A.D. 802,701, where he meets the Eloi, a society of small, elegant, childlike adults. They live in small communities within large and futuristic yet slowly deteriorating buildings, doing no work and having a frugivorous diet. His efforts to communicate with them are hampered by their lack of curiosity or discipline, and he speculates that they are a peaceful, communist society, the result of humanity conquering nature with technology, and subsequently evolving to adapt to an environment in which strength and intellect are no longer advantageous to survival.\nReturning to the site where he arrived, the Time Traveller is shocked to find his time machine missing and eventually concludes that it has been dragged by some unknown party into a nearby structure with heavy doors, locked from the inside, which resembles a Sphinx. Luckily, he had removed the machine's levers before leaving it (the time machine being unable to travel through time without them). Later in the dark, he is approached menacingly by the Morlocks, ape-like troglodytes who live in darkness underground and surface only at night. Within their dwellings, he discovers the machinery and industry that makes the above-ground paradise possible. He alters his theory, speculating that the human race has evolved into two species: the leisured classes have become the ineffectual Eloi, and the downtrodden working classes have become the brutal light-fearing Morlocks. Deducing that the Morlocks have taken his time machine, he explores the Morlock tunnels, learning that due to a lack of any other means of sustenance, they feed on the Eloi. His revised analysis is that their relationship is not one of lords and servants but of livestock and ranchers. The Time Traveller theorizes that intelligence is the result of and response to danger; with no real challenges facing the Eloi, they have lost the spirit, intelligence, and physical fitness of humanity at its peak.\nMeanwhile, he saves an Eloi named Weena from drowning as none of the other Eloi take any notice of her plight, and they develop an innocently affectionate relationship over the course of several days. He takes Weena with him on an expedition to a distant structure that turns out to be the remains of a museum, where he finds a fresh supply of matches and fashions a crude weapon against Morlocks, whom he must fight to get back his machine. He plans to take Weena back to his own time. Because the long and tiring journey back to Weena's home is too much for them, they stop in the forest, and they are then overcome by Morlocks in the night, and Weena faints. The Traveller escapes when a small fire he had left behind them to distract the Morlocks catches up to them as a forest fire; Weena and the pursuing Morlocks are lost in the fire, and the Time Traveler is devastated over his loss.\nThe Morlocks open the Sphinx and use the time machine as bait to capture the Traveller, not understanding that he will use it to escape. He reattaches the levers before he travels further ahead to roughly 30 million years from his own time. There he sees some of the last living things on a dying Earth: menacing reddish crab-like creatures slowly wandering the blood-red beaches chasing enormous butterflies in a world covered in simple lichenous vegetation. He continues to make short jumps through time, seeing Earth's rotation gradually cease and the sun grow larger, redder, and dimmer, and the world falling silent and freezing as the last degenerate living things die out.\nOverwhelmed, he goes back to the machine and returns to Victorian time, arriving at his laboratory just three hours after he originally left. Interrupting dinner, he relates his adventures to his disbelieving visitors, producing as evidence two strange white flowers Weena had put in his pocket. The original narrator then takes over and relates that he returned to the Time Traveller's house the next day, finding him preparing for another journey. After promising to return in a short period of time, the narrator reveals that after 3 years of waiting, the Time Traveller has never returned.","pages":118,"rating":3.87,"title":"The Time Machine","cover":"https:\/\/images.gr-assets.com\/books\/1327942880l\/2493.jpg","id":1,"isbn":"0451528557"},{"summary":"Tales of Space and Time is a fantasy and science fiction collection of three short stories and two novellas written by the English author H. G. Wells between 1897 and 1898. It was first published by Doubleday & McClure Co. in 1899. All the stories had first been published in various monthly periodicals and this was the first volume to collect these stories.","author":"531EDFA6-A361-4E15-873F-45E4EA0AF120","year":1899,"rating":3.84,"title":"Tales of Space and Time","cover":"https:\/\/images.gr-assets.com\/books\/1356557864l\/3497718.jpg","id":51,"isbn":"0836941667"},{"summary":"The Land That Time Forgot is a fantasy novel by American writer Edgar Rice Burroughs, the first of his Caspak trilogy. His working title for the story was \"The Lost U-Boat.\" The sequence was first published in Blue Book Magazine as a three-part serial in the issues for September, October and November 1918. The complete trilogy was later combined for publication in book form under the title of the first part by A. C. McClurg in June 1924. Beginning with the Ace Books editions of the 1960s, the three segments have usually been issued as separate short novels.\n\n","author":"529E6C18-1D27-4056-BB47-9173637E4D5C","year":1918,"plot":"The novel is set in World War I and opens with a framing story in which a manuscript relating the main story is recovered from a thermos off the coast of Greenland. It purports to be the narrative of Bowen J. Tyler, an American passenger with his Airedale Terrier Nobs on a ship sunk in the English Channel by a German U-boat, U-33, in 1916. He is rescued by a British tugboat with another survivor, Lys La Rue. The tug is also sunk, but its crew manages to capture the submarine when it surfaces. Unfortunately, all other British craft continue to regard the sub as an enemy, and they are unable to bring it to port. Sabotage to the navigation equipment sends the U-33 astray into the South Pacific. The imprisoned German crew retakes the sub and begins a raiding cruise, only to be overcome again by the British. A saboteur continues to guide the sub off course, and by the time he is found out it is in Antarctic waters.\nThe U-33 is now low on fuel, with its provisions poisoned by the saboteur Benson. A large island ringed by cliffs is encountered, and identified as Caprona, a land mass first reported by the fictitious Italian explorer Caproni in 1721 whose location was subsequently lost. A freshwater current guides the sub to a stream issuing from a subterranean passage, which is entered on the hope of replenishing the water supply. The U-boat surfaces into a tropical river teeming with primitive creatures extinct elsewhere; attacked, it submerges again and travels upstream in search of a safe harbor. It enters a thermal inland sea, essentially a huge crater lake, whose heat sustains Caprona’s tropical climate. As the sub travels north along the island’s waterways the climate moderates and wildlife undergoes an apparent evolutionary progression.\nOn the shore of the lake the crew builds a palisaded base, dubbed Fort Dinosaur for the area’s prehistoric fauna. The British and Germans agree to work together under Tyler, with Bradley, the mate from the tug, as second in command and Von Schoenvorts, the original sub commander, in control of the Germans. The castaways are attacked by a horde of beast men and take prisoner Ahm, a Neanderthal Man. They learn that the native name for the island is Caspak. Oil is discovered, which they hope to refine into fuel for the U-33. As they set up operations, Bradley undertakes various explorations. During his absence Lys disappears and the Germans abscond with the submarine.\nTyler leaves the other survivors to seek and rescue Lys. A series of adventures ensues among various bands of near-human primitives, each representing a different stage of human advancement, as represented by their weaponry. Tyler rescues Lys from a group of Sto-lu (\"hatchet men\"), and later aids the escape of a woman of the Band-lu (spearmen) to the Kro-lu (bowmen). Lys is lost again, and chance discoveries of the graves of two men associated with Bradley’s expedition leaves Tyler in despair of that party’s fate. Unable to find his way back to Fort Dinosaur, he retreats to the barrier cliffs ringing Caspak in a vain hope of attracting rescue from some passing ship. Improbably reunited with Lys, he sets up house with her, completes the account of his adventures which he has been writing, and casts it out to sea in his thermos.","pages":148,"rating":3.81,"title":"The Land That Time Forgot","cover":"https:\/\/images.gr-assets.com\/books\/1361016682l\/17377791.jpg","id":59},{"summary":"The Time Traders is a science fiction novel by American writer Andre Norton (pseudonym, nï¿½e Alice Mary Norton), the first in The Time Traders series. It was first published in 1958, and has been printed in several editions. It was updated by Norton in 2000 to account for real world changes. It is part of Norton's Forerunner universe.\nThe Time Traders introduces the premise: a confrontation between Western heroes, and the \"Reds\", a mysterious alien race that has used time travel to alter Earth. This novel alternates among the present day, a trading tribal society in Britain, 2000 B.C., and a glacial outpost in the last ice age.","author":"B3A20DC5-28B5-43AA-BABF-0F5D18743FA5","year":1958,"plot":"The 1958 version: At the end of the Twentieth Century petty crook Ross Murdock is given the choice of facing a new medical procedure called Rehabilitation or volunteering to join a secret government project. Hoping for a chance to escape, Ross volunteers to join Operation Retrograde and is taken by Major John Kelgarries to a base built under the ice near the North Pole. Teamed with archaeologist Gordon Ashe, he is trained to mimic a trader of the Beaker culture of Bronze-Age Europe.\nSent back to southern Britain around 2000 B.C.E., Ross and Ashe (as Rossa and Assha) find that their outpost has been bombed, destroyed by the wrath of Lurgha, the local storm god, according to two of the natives. Discovering the direction whence the bomber came and other clues pointing to the general area occupied by the Soviet base, Ross, Ashe, and McNeil, the lone survivor of the bombing, go to that area.\nSomewhere near the Baltic Sea, Ross, Ashe, and McNeil begin building a Beaker trading post and learn from the locals that to their southeast lies a land populated by ghosts, a land whither no man of good sense would go. Ross gets separated from Ashe and McNeil in a night attack and must go into the taboo area alone in an effort to find them. Far inside the ghostland he finds the Soviet base and is captured by the Reds.\nIn an effort to escape Ross steps onto the base’s transporter plate and is transferred to a Soviet base even further back in time. The Reds recapture him and take him outside the base, abandoning him on a glacier to freeze to death. He climbs out of the crevice into which he was shoved and follows the trail leading away from the Soviet base, coming to a giant globe half buried in the ice. Half dead from the abuse he has received, he enters the globe and then falls through a panel and into a tub full of transparent-red gel.\nWhen he regains consciousness Ross discovers that all of his wounds are healed, he is no longer hungry or thirsty, and his Beakerman clothing is gone. A mechanism offers him a skin-tight suit made of an iridescent dark-blue fabric that covers all but his head and his hands. He explores what is clearly some kind of ship and is recaptured by the Reds, but not before he activates the ship’s communication system and comes face to face with a hostile-looking humanoid with a large bald head.\nThe Reds’ interrogation of Ross is interrupted by explosions that rock the base. Ross is reunited with Ashe and McNeil and the three men escape to the time transporter, pausing only to steal some recording tapes. Back in the Soviet Bronze-Age base, the men leave the time-travel building and escape from the village just as the alien Baldies attack. The men then make their way to the river that will take them to the Baltic Sea to be picked up by their submarine.\nRoss is again separated from Ashe and McNeil when he falls off their hastily built and uncontrollable raft. He discovers that the Baldies are hunting him when he is captured by warriors from a barbarian tribe. Again he escapes and continues down the river, reaching the sea and the camp occupied by Ashe and\/or McNeil only hours after the sub took them away. Two of the Baldies attempt to capture him with telepathic hypnosis, but they flee when Kelgarries and his men arrive. Leaving the alien skinsuit on the beach, so that the Baldies can’t trace the Americans to their base, the men take Ross to the sub and home. There Ashe tells him that the tapes he stole indicate other alien spaceships abandoned on Earth, at least three of them in the Americas. Operation Retrograde is about to become much more interesting and Ross still wants to be part of the action.\nThe 2000 version: Norton modified the 1958 version by making three changes in the text;\n1. She reset the story in the first quarter of the Twenty-First Century instead of in the last quarter of the Twentieth, shifting the action futureward by a full generation.\n2. The Reds have become the Russians and Greater Russia has replaced the Soviet Union.\n3. Space travel has not gone beyond the first lunar landings instead of having not gotten beyond the first attempts to put satellites into orbit. Instead of being ridiculed as impossible, space travel is publicly ridiculed as infeasible.","pages":7,"rating":3.74,"title":"The Time Traders","cover":"https:\/\/images.gr-assets.com\/books\/1352670826l\/462373.jpg","id":72},{"summary":"Key Out of Time is a science fiction novel by American writer Andre Norton, the fourth in her series The Time Traders. It was first published in 1963, and as of 2012, had been reprinted in 17 editions with cover changes, as well as twice in a combined edition with The Defiant Agents. It is part of Norton's Forerunner universe.\nKey Out of Time continues the series’ premise, an encounter between Western heroes, and the Russian Communists, and the Baldies, a mysterious alien race that used time travel to alter Earth. Events in the previous novel, The Defiant Agents, are treated as a Time Agent failure — but read that novel for a different interpretation. The setting of this novel is a world, Hawaika, appearing to be a tropical paradise.\nKirkus Reviews, strongly supportive after following the series for years, writes, “Again, Andre Norton, one of the greats among writers of teenage science fiction (Galactic Derelict, 1959, p.658, J-316, for one), has employed [her] boundless imagination… Owing to the author’s exceptional mastery of detail, and astute control of plot, Key Out of Time stands as a novel which should more than satisfy young science fiction fanciers and fanatics.”","author":"B3A20DC5-28B5-43AA-BABF-0F5D18743FA5","year":1963,"plot":"In the present day, Time Agents Ross and Gordon come with settlers to the water-dominated planet, Hawaika, to search remains of the alien Baldies from the distant past. Intelligent dolphins assist them. While setting up their time gate, a storm destroys it and strands them widely separated in the unknown past.\nThe dolphins and humans can communicate, and Ross learns Gordon is hostage in a castle through a native, Loketh. Ross and Loketh are captured by seafaring Rovers, then join them. They liberate a Rover island captured by the Baldies. Ross convinces a coalition of natives the Baldies are playing them against one another. Ross finds Ashe at last, in the company of the mystic and advanced Foanna, who turn out to be only three, the last of their race. The Foanna set a trap for the Baldies, using their castle as bait, but they cannot win against the whole force without increasing their numbers. Ross and Ashe agree to a process mentally joining them with the Foanna. A second encounter with the Baldies, they win. In a final encounter, Ross is teleported to a Baldy ship like the one familiar to him from Galactic Derelict, and sets its course to a random destination. The main Baldy installation is simultaneously attacked and the Baldies driven off the planet.","pages":144,"rating":3.82,"title":"Key Out of Time","cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","id":74,"isbn":"0809501686"},{"summary":"The People That Time Forgot is a fantasy novel by American writer Edgar Rice Burroughs, the second of his Caspak trilogy. The sequence was first published in Blue Book Magazine as a three-part serial in the issues for September, October and November 1918, with The People That Time Forgot forming the second installment. The complete trilogy was later combined for publication in book form under the title of The Land That Time Forgot (properly speaking the title of the first part) by A. C. McClurg in June 1924. Beginning with the Ace Books editions of the 1960s, the three segments have usually been issued as separate short novels.","author":"529E6C18-1D27-4056-BB47-9173637E4D5C","year":1918,"plot":"The novel begins with the organization of an expedition to rescue Bowen J. Tyler, Lys La Rue, and the other castaways marooned on the large Antarctic island of Caprona, whose tropical interior, known to its inhabitants as Caspak, is home to prehistoric fauna of all eras. Tyler's recovered manuscript detailing their ordeal is delivered to his family, and the relief effort is put together by Tom Billings, secretary of the Tyler shipbuilding business. The expedition's ship, the Toreador, locates Caprona, and while the bulk of the crew attempts to scale the encircling cliffs Billings flies over them in an aircraft.\nBillings' plane is attacked by flying reptiles and forced down in the interior of Caspak. He saves a native girl named Ajor from a large cat and a group of ape-men, and undertakes to accompany her back to her people, the fully human Galus, while she educates him in the language and mysteries of the island. They travel north, encountering various creatures of the Mesozoic and Cenozoic eras, as well as additional primitive subhuman races. They pass through the lands of the Neanderthal Bo-lu (club men) and the more advanced Sto-lu (hatchet men), who are easily cowed by gunfire. But in the country of the Band-lu (spear men) he is taken captive, and despairs until rescued in turn by Ajor. They resume their journey, re-encountering and befriending Tomar, a Band-lu newly become Kro-lu (bow man). Tomar and his mate So-al are the first examples Billings has actually seen of Caspakian evolutionary metamorphosis in action.\nAfter an interlude in which Ajor's back story is related the new friends separate. Billings and Ajor enter Kro-lu territory and save Chal-az, a Kro-lu warrior, from a group of Band-lu. Visiting the Kro-lu village as his guest, they are parted again when Billings is attacked through the machinations of the chief Du-seen, who has designs on Ajor. They escape individually, making for the Galu country. Du-seen goes after Ajor with some of his warriors.\nBillings catches and tames an ancestral horse, with the aid of which he rescues Ajor from Du-seen. Pursued, they resign themselves to death, but are relieved by a force consisting of Bowen Tyler, Galu warriors, and the rescue crew from the Toreador, which had successfully scaled the cliffs and entered Caspak after Billings' ill-fated airplane flight. All are reunited in the Galu village, where Tyler and Lys La Rue have been formally married by the captain of the Toreador. Billings and Ajor also desire to wed, but Ajor may not leave Caspak due to her status as cos-ata-lo – she was born a fully evolved Galu rather than attaining that form through metamorphosis, and hence is treasured by her people. Billings elects to remain in Caspak to be with her.","pages":100,"rating":3.7,"title":"The People That Time Forgot","cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","id":82,"isbn":"160096348X"},{"summary":"Out of Time’s Abyss is a fantasy-science fiction novel by American writer Edgar Rice Burroughs, the third of his Caspak trilogy. The sequence was first published in Blue Book Magazine as a three-part serial in the issues for September, October and November 1918, with Out of Time's Abyss forming the third installment. The complete trilogy was later combined for publication in book form under the title of The Land That Time Forgot (the title of the first part) by A. C. McClurg in June 1924. Beginning with the Ace Books editions of the 1960s, the three segments have usually been issued as separate short novels.\n\n","author":"529E6C18-1D27-4056-BB47-9173637E4D5C","year":1918,"plot":"The book begins with Bradley, who had left Fort Dinosaur on an expedition in the first novel and never returned. Bradley and his party are attempting to return to Fort Dinosaur. Along the way, they encounter a creature which appears to be a flying dead man. Some of the members of the party consider it to be a ghost or banshee. Tippet is convinced that he is soon to die, and the next day he is killed by a Tyrannosaurus. The ghost-like creature is seen again, and James is killed by a Smilodon. Bradley disappears during the night, and the remaining members of the party make it safely to Fort Dinosaur.\nBradley had been captured by the ghost-like creature, which is soon revealed to be a naturally winged human being, belonging to a subgroup of humanity known as the Wieroo. The Wieroo takes Bradley to the island of Oo-oh, set in Caspak's inland sea. It attempts to keep Bradley in a prison, but he escapes through a secret passage. He meets Co-Tan, a member of the highest human race of mainland Caspak, the Galu, fully human and of a neolithic cultural level. They enter the chamber of the Wieroo king, a huge member of the race, and Bradley kills the creature with its own sword.\nCo-Tan and Bradley escape the city of the Wieroo and live for several months on the forested coast of Oo-oh. Finally, though, they are discovered by Wieroo. They succeed in capturing two of the Wieroo and forcing them to fly to the mainland, one bearing each of the humans.\nOn the Caspakian mainland, Co-Tan and Bradley meet the party from the outside world from the previous two books, and they return home to America, where Bradley will marry Co-Tan.","pages":136,"rating":3.64,"title":"Out of Time's Abyss","cover":"https:\/\/images.gr-assets.com\/books\/1391794329l\/1397217.jpg","id":111,"isbn":"1595402284"},{"author":"A71FCBA3-151F-4492-82B2-4BFE921B73CA","year":1953,"rating":3.95,"title":"A Traveler in Time","cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","id":123},{"summary":"This book was converted from its physical to the digital format by a community of volunteers. You may find it for free on the web. Purchase of the Kindle edition includes wireless delivery.","author":"67677A90-8598-4B07-B6E2-1CA5F434920B","year":1953,"rating":3.05,"title":"Sentiment, Inc.","cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","id":155},{"summary":"Two Timer in the February 1954 issue of Galaxy Science Fiction.<br \/><br \/>Here is a brace of vignettes by the Old Vignette Master ... short and sharp ... like a hypodermic!<br \/>- Experiment<br \/>- Sentry","author":"528FCA1A-62A2-480D-97F8-67B003052CE3","year":1954,"pages":12,"rating":3.54,"title":"Two Timer","cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","id":167},{"author":"FA545141-9C4A-49BB-B5DC-F1D185E0A7A2","year":1947,"pages":34,"rating":4.03,"title":"Time and Time Again","cover":"https:\/\/images.gr-assets.com\/books\/1330215590l\/6477408.jpg","id":178},{"summary":"This short novel by H. Beam Piper was originally published in two parts in <i>Astounding Science Fiction,<\/i> February and March of 1955, and also appeared in the 1981 collection <i>Paratime.<\/i> In the world in which <i>Time Crime<\/i> takes place, human society has developed the technology to move laterally between parallel universes. The heroes of this story, Verken Vall and his wife Hadron Dalla, are ready to embark on a long-overdue vacation, when the Paratime Police send them both to investigate rumors of slavery in the Esaron Sector. Like many of Piper's stories, this is a police procedural, set in the world of the future.<br \/><br \/><br \/>Free audiobook:<br \/><a target=\"_blank\" href=\"http:\/\/www.podiobooks.com\/title\/time-crime\" rel=\"nofollow\">http:\/\/www.podiobooks.com\/title\/time-...<\/a>","author":"FA545141-9C4A-49BB-B5DC-F1D185E0A7A2","year":1955,"pages":116,"rating":4.18,"title":"Time Crime","cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","id":215,"isbn":"1598189603"},{"summary":"_All Dave Miller wanted to do was commit suicide in peace. He tried, but the things that happened after he'd pulled the trigger were all wrong. Like everyone standing around like statues. No St. Peter, no pearly gate, no pitchforks or halos. He might just as well have saved the bullet!_","author":"8AFEC044-0C4C-4B0A-AEC6-AC6A984DCF58","year":1940,"pages":14,"rating":3.08,"title":"The Day Time Stopped Moving","cover":"https:\/\/images.gr-assets.com\/books\/1291832586l\/5955088.jpg","id":351},{"author":"E0FD52BC-8BA6-4F48-B40F-031692DDE201","year":1954,"rating":3.75,"title":"Time Fuze","cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","id":369},{"summary":"Science fiction short story.","author":"B9E6A3CA-6C9F-47D8-B997-5D8EB7A9A6FB","year":1963,"rating":4.01,"title":"The Right Time","cover":"https:\/\/images.gr-assets.com\/books\/1417560342l\/12764688.jpg","id":406},{"summary":"<b>By millions of millions the creatures of earth slow and drop when their time-sense is mysteriously paralyzed.<\/b><br \/><i>Time Manipulation<\/i><br \/><br \/>Play Duration: 00:54:47 <br \/>Down load file sizes<br \/>[mp3@64kbps - 26.2MB]<br \/>[mp3@128kbps - 52.5MB]<br \/><br \/>Public Domain stories from Project Gutenberg, that are read by volunteers. <br \/>First published in Astounding Stories","author":"8914045C-1A00-406D-BA8A-D78E2741A58C","year":1933,"rating":3.76,"title":"The End of Time","cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","id":473},{"author":"F4F0A07F-9C1B-490D-842E-A3F00DAE5E64","year":1962,"rating":4.28,"title":"The Winds of Time","cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","id":458},{"summary":"This collection of literature attempts to compile many of the classic works that have stood the test of time and offer them at a reduced, affordable price, in an attractive volume so that everyone can enjoy them.","author":"6E15197D-2241-4DA0-B63D-0C763DACFC54","year":1954,"rating":3.87,"title":"The Man from Time","cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","id":512},{"author":"B3595982-BDA9-421F-9402-17B18A4CE12D","year":1957,"rating":3.75,"title":"Time In the Round","id":513},{"author":"DD75F636-9BC3-40C7-8AF7-55D69AF0FCF5","year":1961,"rating":0,"title":"Arcturus Times Three","cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","id":614},{"summary":"You do not always have to go looking for a guardian angel. He may be looking for you-but perhaps for somebody else's benefit! Rhadampsicus and Nodalictha were on their honeymoon, and consequently they were sentimental. To be sure, it would not have been easy for humans to imagine sentiment as existing between them. Humans would hardly associate tenderness with glances cast from sets of sixteen eyes mounted on jointed eye stalks, nor link langorous thrills with a coy mingling of positronic repulsion blasts-even when the emission of positron blasts from beneath one's mantle was one's normal personal mode of locomotion. And when two creatures like Rhadampsicus and Nodalictha stood on what might be roughly described as their heads and twined their eye stalks together, so that they gazed fondly at each other with all sixteen eyes at once, humans would not have thought of it as the equivalent of a loving kiss. Humans would have screamed and run-if they were not paralyzed by the mere sight of such individuals.","author":"0B701496-D00F-4284-B989-1B8800B0CA44","year":1953,"pages":46,"rating":2.7,"title":"The Sentimentalists","cover":"https:\/\/images.gr-assets.com\/books\/1500962774l\/29058836.jpg","id":638,"isbn":"1515404129"},{"author":"51EBF39A-48A1-40CD-867B-7C2A6EE533A0","id":921,"summary":"Free ebook download from manybooks.net, all formats.<br \/><br \/>William Nolan, introduces us to the capricious Time Door of Professor C. Cydwick Ohms, guaranteed to solve the accumulated problems of the world of the year 2057. Open the C. Cydwick Ohms Time Door, take but a single step, and--","title":"Of Time and Texas","rating":3.96,"pages":12,"year":1956,"cover":"https:\/\/images.gr-assets.com\/books\/1390862976l\/18165044.jpg"}]