[{"title":"The Dark Door","id":372,"cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","author":"212436F0-2155-41D5-83AF-98DD1D897A25","summary":"\"...he knew the game-playing was over. They wanted to kill him now. And he knew that ultimately they would kill him. There was no way for him to escape.\" From Text<br \/><br \/>First published in The Counterfeit Man More Science Fiction Stories by Alan E. Nourse.","rating":4.17,"year":1953},{"isbn":"1532838484","title":"The God Next Door","id":574,"cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","author":"EA222973-EF70-41BA-B658-47544687EBC2","summary":"This collection of literature attempts to compile many of the classic works that have stood the test of time and offer them at a reduced, affordable price, in an attractive volume so that everyone can enjoy them.","rating":4.33,"pages":28,"year":1961},{"isbn":"1535025042","title":"Clean Break","id":712,"cover":"https:\/\/images.gr-assets.com\/books\/1490170096l\/30895983.jpg","author":"9C96488C-BE47-41D2-A3C8-D816D0C2316C","summary":"A veteran veterinarian might have vamoosed-but Watts had to help any sick animal.... Nothing more exciting ever happened to Oliver Watts than being rejected by his draft board for a punctured eardrum until, deferring as usual to the superior judgment of his Aunt Katisha and of Glenna-his elder and militantly spinster sister-he put away his lifelong dream and took up, at the age of twenty-five, the practice of veterinary medicine. The relinquished dream was Oliver's ambition, cherished since childhood, to become some day a hunter and trainer of jungle animals. It had been discouraged firmly and at length by his Aunt Katisha, who maintained that the skin of the last male Watts was not to be risked in a pursuit so perilous; and his Aunt Katisha won. He would do far better, Oliver realized finally, to resign himself to the quiet suburban life of Landsdale, Florida, and to perpetuate the Watts line by marrying some worthy and practical local girl. The quiet life, it developed, was that of a D. V. M.; the worthy and practical girl, Miss Orella Simms of Tampa, to whom he was now engaged.","rating":3.61,"pages":28,"year":1953},{"isbn":"0441843328","title":"The Ultimate Weapon","plot":"Alien invaders escape their doomed home-planet of Mira and bring their starship fleet to conquer Earth. Nothing stands in the way of the Miran invaders, except Buck Kendall, who has discovered the ultimate weapon that is Earth's last hope.","id":152,"cover":"https:\/\/images.gr-assets.com\/books\/1260836845l\/2153684.jpg","author":"85F6455C-EFA7-4E11-934A-1B3669976627","summary":"The Ultimate Weapon is a 1966 science fiction novel by American writer John W. Campbell.","rating":3.81,"year":1966},{"author":"5806B79B-884F-4F81-80AC-3F30426F5920","title":"Cubs of the Wolf","id":772,"cover":"https:\/\/images.gr-assets.com\/books\/1409246829l\/6328938.jpg","year":1955,"summary":"<em>from the introductory:<\/em><p>In the spring the cherry blossoms are heavy in the air over the campus of Solarian Institute of Science and Humanities. On a small slope that rims the park area, Cameron Wilder lay on his back squinting through the cloud of pink-white petals to the sky beyond. Beside him, Joyce Farquhar drew her jacket closer with an irritated gesture. It was still too cold to be sitting on the grass, but Cameron didn't seem to notice it-or anything else, Joyce thought.<br \/><br \/>\"If you don't submit a subject for your thesis now,\" she said, \"you'll take another full six months getting your doctorate. Sometimes I think you don't really want it!\"<br \/><br \/>Cameron stirred. He shifted his squinting gaze from the sky to Joyce and finally sat up. But he was staring ahead through the trees again as he took his pipe from his pocket and began filling it slowly.<br \/><br \/>\"I <i>don't<\/i> want it if it's not going to mean anything after I get it,\" he said belligerently. \"I'm not going to do an investigation of some silly subject like The Transience of Venusian Immigrants in Relation to the Martian Polar Ice Cap Cycle. Solarian sociologists are the butt of enough ridicule now. Do something like that and for the rest of your life you get knocking of the knees whenever anybody inquires about the speciality you worked in and threatens to read your thesis.\"<br \/><br \/>\"Nobody's asking you to do anything you don't want to. But <i>you<\/i> picked the field of sociology to work in. Now I don't see why you have to act such a purist that it takes months to find a research project for your degree. Pick something -- anything! -- I don't care what it is. But if you don't get a degree and an appointment out of the next session I don't think we'll ever get married -- not ever.\"<br \/><br \/>Cameron removed his pipe from his mouth with a precise grip and considered it intently as it cupped in his hands. \"I'm glad you mentioned marriage,\" he said. \"I was just about to speak of it myself.\"<br \/><br \/>\"Well, don't!\" said Joyce. \"After three years -- Three years!\"<br \/><br \/>He turned to face her and smiled for the first time. He liked to lead her along occasionally just to watch her explode, but he was not always sure when he had gone too far. Joyce had a mind like a snapping, random matching calculator while he operated more on a slow, carefully shaping analogue basis, knowing things were never quite what they seemed but trying to get as close an approximation of the true picture as possible.<br \/><br \/>\"Will you marry me now?\" he said.<br \/><br \/>The question did not seem to startle her. \"No degree, no appointment -- and no chance of getting one -- we couldn't even get a license. I hope you aren't suggesting we try to get along without one, or on a forgery!\"<\/p>","rating":3.67},{"author":"572E2F88-23D4-4A78-91A0-644F0852991C","title":"The Affair of the Brains","id":315,"cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","year":1932,"summary":"Hawk Carse himself goes to keep Judd the Kite's rendezvous with the sinister genius Ku Sui. Lester del Rey was an American science fiction author and editor at Del Rey Books. He was awarded the E. E. Smith Memorial Award for Imaginative Fiction, Balrog Award and the 11th SFWA Grand Master.","rating":3},{"author":"9C96488C-BE47-41D2-A3C8-D816D0C2316C","title":"Control Group","id":803,"cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","year":1960,"summary":"<b>\"Any problem posed by one group of human beings can be resolved by any other group.\" That's what the Handbook said. But did that include primitive humans? Or the Bees? Or a ...<\/b><br \/><br \/>Play Duration: 00:35:26 <br \/>Down load file sizes<br \/>[mp3@64kbps - 17.0MB]<br \/>[mp3@128kbps - 34.0MB]<br \/>[ogg vorbis - 17MB]<br \/><br \/>Public Domain stories from Project Gutenberg, that are read by volunteers. <br \/>First published in Amazing Science Fiction Stories","rating":3},{"author":"C338BF96-07C9-46EF-AB7A-DAFE8C671C52","title":"The Monster","id":291,"cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","year":1949,"rating":4.36},{"author":"21483ADC-8C8D-4574-BA6F-9BE4D764AE69","title":"Astounding Stories of Super-Science, November, 1930","id":104,"cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","year":1930,"rating":3.64},{"author":"D064609C-FEED-46C5-ABFB-D92492DC81E7","title":"In the Orbit of Saturn","id":538,"cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","year":1931,"rating":3.4},{"author":"56525277-24EA-4CD1-8493-918A5919D7B7","title":"The Guardians","id":649,"cover":"https:\/\/images.gr-assets.com\/books\/1327873659l\/6328912.jpg","pages":18,"year":1955,"summary":"It's not always \"The Truth shall set you free!\" Sometimes it's \"Want of the Truth shall drive you to escape!\" And that can be dangerous!","rating":4.14},{"author":"43BC9D93-D88B-45B0-8180-8B9FDD992B1F","title":"20.000 Mijlen onder Zee: Oostelijk Halfrond","id":365,"cover":"https:\/\/images.gr-assets.com\/books\/1498915302l\/35552340.jpg","year":1869,"summary":"20.000 Mijlen onder Zee: Oostelijk Halfrond","rating":3.86,"isbn":"1548332089"},{"author":"5D5EF10B-4A63-42D2-B0FC-6C87D893BFA4","title":"The Green Beret","id":776,"cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","year":1961,"rating":3.9},{"author":"2C0B7FC9-127C-48CB-9781-8408F392B00D","title":"Acid Bath","id":434,"cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","year":1952,"rating":3.22,"isbn":"3655277288"},{"author":"6141B2FE-6D2D-47F5-B627-9A05516A13C9","title":"Operation Distress","id":327,"cover":"https:\/\/images.gr-assets.com\/books\/1501632484l\/35896831.jpg","year":1951,"rating":3},{"author":"B9357162-66E9-4F39-A3BA-A86B9506F9B6","title":"A Columbus of Space","id":948,"cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","pages":212,"year":1909,"summary":"We simply listened in silence; for what could we say? The facts were more eloquent than any words, and called for no commentary. Here we \"were, \" out in the middle of space; and \"there\" was the earth, hanging on nothing, like a summer cloud. At least we knew where we were if we didn't quite understand how we had got there. . . .","rating":3.3,"isbn":"1598185152"},{"author":"5F54F229-AC31-471B-96E2-FD8B90F7356F","title":"Step IV","id":872,"cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","year":1960,"rating":2},{"author":"5AD8A396-BAC4-4146-A31A-847B42FDCA1B","title":"The Face and the Mask","id":229,"cover":"https:\/\/s.gr-assets.com\/assets\/nophoto\/book\/111x148-bcc042a9c91a29c1d680899eff700a03.png","year":1894,"summary":"Novel by the teacher, journalist, editor and novelist, born in Glasgow, Scotland and educated in Canada. In 1876 he became a member of the staff of the Detroit Free Press, in which his contributions appeared under the signature \"Luke Sharp.\" In 1881 he removed to London, to establish the weekly English edition of the Free Press, and in 1892 he joined Jerome K. Jerome in founding the Idler magazine, from whose co-editorship he retired in 1895. He was a prolific author, producing many popular novels of the day.","rating":4.43},{"author":"58231BEB-C487-493F-90EC-AF6873295790","title":"Oh, Rats!","id":558,"cover":"https:\/\/images.gr-assets.com\/books\/1501633043l\/35896870.jpg","year":1961,"rating":3.74},{"author":"00FE8351-4A49-4BDD-A508-A1B226AD26A9","title":"Flatland: A Romance of Many Dimensions","id":32,"cover":"https:\/\/images.gr-assets.com\/books\/1435435775l\/433567.jpg","pages":96,"year":1884,"summary":"Flatland: A Romance of Many Dimensions is a satirical novella by the English schoolmaster Edwin Abbott Abbott, first published in 1884 by Seeley & Co. of London.\nWritten pseudonymously by \"A Square\", the book used the fictional two-dimensional world of Flatland to comment on the hierarchy of Victorian culture, but the novella's more enduring contribution is its examination of dimensions.\nSeveral films have been made from the story, including the feature film Flatland (2007). Other efforts have been short or experimental films, including one narrated by Dudley Moore and the short films Flatland: The Movie (2007) and Flatland 2: Sphereland (2012).","rating":3.81,"plot":"The story describes a two-dimensional world occupied by geometric figures, whereof women are simple line-segments, while men are polygons with various numbers of sides. The narrator is a square named A Square, a member of the caste of gentlemen and professionals, who guides the readers through some of the implications of life in two dimensions. The first half of the story goes through the practicalities of existing in a two-dimensional universe as well as a history leading up to the year 1999 on the eve of the 3rd Millennium.\nOn New Year's Eve, the Square dreams about a visit to a one-dimensional world (Lineland) inhabited by \"lustrous points\", in which he attempts to convince the realm's monarch of a second dimension; but is unable to do so. In the end, the monarch of Lineland tries to kill A Square rather than tolerate his nonsense any further.\nFollowing this vision, he is himself visited by a three-dimensional sphere named A Sphere, which he cannot comprehend until he sees Spaceland (a tridimensional world) for himself. This Sphere visits Flatland at the turn of each millennium to introduce a new apostle to the idea of a third dimension in the hopes of eventually educating the population of Flatland. From the safety of Spaceland, they are able to observe the leaders of Flatland secretly acknowledging the existence of the sphere and prescribing the silencing of anyone found preaching the truth of Spaceland and the third dimension. After this proclamation is made, many witnesses are massacred or imprisoned (according to caste), including A Square's brother, B.\nAfter the Square's mind is opened to new dimensions, he tries to convince the Sphere of the theoretical possibility of the existence of a fourth (and fifth, and sixth ...) spatial dimension; but the Sphere returns his student to Flatland in disgrace.\nThe Square then has a dream in which the Sphere visits him again, this time to introduce him to Pointland, whereof the point (sole inhabitant, monarch, and universe in one) perceives any communication as a thought originating in his own mind (cf. Solipsism):\n\n\"You see,\" said my Teacher, \"how little your words have done. So far as the Monarch understands them at all, he accepts them as his own – for he cannot conceive of any other except himself – and plumes himself upon the variety of Its Thought as an instance of creative Power. Let us leave this God of Pointland to the ignorant fruition of his omnipresence and omniscience: nothing that you or I can do can rescue him from his self-satisfaction.\"\n\nThe Square recognizes the identity of the ignorance of the monarchs of Pointland and Lineland with his own (and the Sphere's) previous ignorance of the existence of higher dimensions. Once returned to Flatland, the Square cannot convince anyone of Spaceland's existence, especially after official decrees are announced that anyone preaching the existence of three dimensions will be imprisoned (or executed, depending on caste). Eventually the Square himself is imprisoned for just this reason, with only occasional contact with his brother who is imprisoned in the same facility. He does not manage to convince his brother, even after all they have both seen. Seven years after being imprisoned, A Square writes out the book Flatland in the form of a memoir, hoping to keep it as posterity for a future generation that can see beyond their two-dimensional existence.","isbn":"048627263X"}]